app/views/checkout/address.html.erb

      <div class="col-md-8" >
        <% find_address = current_user.addresses.where(status: 'active').count %>
        <% address1 = current_user.addresses.first %>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1 AND "addresses"."status" = $2  [["user_id", 1], ["status", "active"]]
SELECT COUNT(*) FROM "addresses" WHERE "addresses"."user_id" = $1 AND "addresses"."status" = $2  [["user_id", 1], ["status", "active"]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1 ORDER BY "addresses"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

              <tr>
                <td><% item.dish.pictures.each do |p| %>
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]