app/views/checkout/cart.html.erb

SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]
---
<div class="container">
	<% count_cart = @current_cart.line_items.count %>

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
							<%= link_to dish_path(item.dish) do %>
								<% item.dish.pictures.each do |p| %>

SELECT "restaurants".* FROM "restaurants" INNER JOIN "dishes_restaurants" ON "restaurants"."id" = "dishes_restaurants"."restaurant_id" WHERE "dishes_restaurants"."dish_id" = $1  [["dish_id", 1]]
---
							</p>
							<% item.dish.restaurants.each do |r| %>