app/views/checkout/payment.html.erb

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            <tr>
              <td><% item.dish.pictures.each do |p| %>