app/controllers/admin/dishes_controller.rb

	def index
    @restaurant = Restaurant.find(params[:restaurant_id])
    # @dishes =   @restaurant.dishes.order(created_at: :asc).paginate(page:  params[:page], per_page: 4)
    @dishes = Dish.all.paginate(page:  params[:page], per_page: 4)
    @ratings = Dish.by_rating.all
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "dishes".* FROM "dishes" LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]
SELECT AVG("ratings"."rating") FROM "ratings" WHERE "ratings"."dish_id" = $1  [["dish_id", 1]]

  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @dish = @restaurant.dishes.create(dish_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "dishes" ("name", "price", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "chicken biryani"], ["price", "100"], ["category_id", 2], ["created_at", "2020-04-18 02:57:40.089023"], ["updated_at", "2020-04-18 02:57:40.089023"]]