app/controllers/admin/dishes_controller.rb

	def index
    @restaurant = Restaurant.find(params[:restaurant_id])
    @dishes =   @restaurant.dishes.order(created_at: :asc).paginate(page:  params[:page], per_page: 4)
---
SELECT  "dishes".* FROM "dishes" INNER JOIN "dishes_restaurants" ON "dishes"."id" = "dishes_restaurants"."dish_id" WHERE "dishes_restaurants"."restaurant_id" = $1 ORDER BY "dishes"."created_at" ASC LIMIT $2 OFFSET $3  [["restaurant_id", 6], ["LIMIT", 4], ["OFFSET", 0]]