app/controllers/admin/orders_controller.rb

	def index
    @orders = Order.all.order(created_at: :asc).paginate(page:  params[:page], per_page: 5)
---
SELECT  "orders".* FROM "orders" ORDER BY "orders"."created_at" ASC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM `orders`

  def update
    @order = Order.find(params[:id])
    if @order.update_attributes(order_params)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "order_status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["order_status", "Shipped"], ["updated_at", "2020-04-18 03:14:45.407494"], ["id", 1]]