app/controllers/admin/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" ORDER BY "restaurants"."created_at" ASC LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM `restaurants`
---
	def index
    @restaurants = Restaurant.all.order(created_at: :asc).paginate(page:  params[:page], per_page: 4)

INSERT INTO "restaurants" ("name", "created_at", "updated_at", "email", "phone") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Kokila"], ["created_at", "2020-04-12 23:28:20.878047"], ["updated_at", "2020-04-12 23:28:20.878047"], ["email", "kokila@gmail.com"], ["phone", 9502458428]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "dishes".* FROM "dishes" INNER JOIN "dishes_restaurants" ON "dishes"."id" = "dishes_restaurants"."dish_id" WHERE "dishes_restaurants"."restaurant_id" = $1  [["restaurant_id", 2]]
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 1]]
DELETE FROM "dishes_restaurants" WHERE "dishes_restaurants"."restaurant_id" = $1  [["restaurant_id", 2]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 2]]
---
  def destroy
   @restaurant = Restaurant.find(params[:id])
   @dishes = @restaurant.dishes
      @dishes.each do |d|
        d.destroy
      end
    @restaurant.destroy