app/controllers/admin/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM `orders` WHERE `orders`.`user_id` = 53
SELECT COUNT(*) FROM `users`
---
	def index
    @users = User.all.order(created_at: :desc).paginate(page:  params[:page], per_page: 5)