app/views/admin/dashboard.html.erb

            <h3>Total Restaurants</h3>
            <%= Restaurant.all.count  %>
---
SELECT COUNT(*) FROM `restaurants`

            <h3>Total orders</h3>
            <%= Order.all.count  %>
---
SELECT COUNT(*) FROM `orders`

            <h3>Registered users</h3>
            <%= User.all.count %>
---
SELECT COUNT(*) FROM `users`