app/views/admin/index.html.erb

SELECT COUNT(*) FROM `restaurants`
---
            <h3>Total Restaurants</h3>
            <%= Restaurant.all.count  %>

SELECT COUNT(*) FROM `orders`
---
            <h3>Total orders</h3>
            <%= Order.all.count  %>

SELECT COUNT(*) FROM `users`
---
            <h3>Registered users</h3>
            <%= User.all.count %>