app/views/shared/_nav.html.erb

SELECT COUNT(*) FROM "wishlists" WHERE "wishlists"."user_id" = $1  [["user_id", 2]]
---
                  <li class="nav-item">
                    <% count_list = current_user.wishlists.count %>

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 7]]
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 23]]
---
                  <li class="nav-item">
                    <% count_cart = @current_cart.line_items.count %>

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 23]]
---
                      <% total_count = 0 %>
                      <% @current_cart.line_items.each do |item| %>

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 14]]
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 21]]
---
                  <li class="nav-item">
                    <% count_cart = @current_cart.line_items.count %>

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 23]]
---
                      <% total_count = 0 %>
                      <% @current_cart.line_items.each do |item| %>