app/views/admin/restaurants/index.html.erb

SELECT "locations"."street", "locations"."city", "locations"."state" FROM "locations" INNER JOIN "locations_restaurants" ON "locations"."id" = "locations_restaurants"."location_id" WHERE "locations_restaurants"."restaurant_id" = $1  [["restaurant_id", 1]]
SELECT "dishes"."name" FROM "dishes" INNER JOIN "dishes_restaurants" ON "dishes"."id" = "dishes_restaurants"."dish_id" WHERE "dishes_restaurants"."restaurant_id" = $1  [["restaurant_id", 1]]
---
                    <% end %></td>
                <td><%= truncate(r.locations.pluck(:street, :city, :state).join(',')) %></td>
                <td><%= truncate(r.dishes.pluck(:name).join(',')) %></td>