app/views/admin/restaurants/show.html.erb

        <div>
          <% @restaurant.locations.each do|p|%>
---
SELECT "locations".* FROM "locations" INNER JOIN "locations_restaurants" ON "locations"."id" = "locations_restaurants"."location_id" WHERE "locations_restaurants"."restaurant_id" = $1  [["restaurant_id", 1]]

          <label><b>Dishes: </b></label>
             <%= @restaurant.dishes.pluck(:name).join(',') %>
---
SELECT "dishes"."name" FROM "dishes" INNER JOIN "dishes_restaurants" ON "dishes"."id" = "dishes_restaurants"."dish_id" WHERE "dishes_restaurants"."restaurant_id" = $1  [["restaurant_id", 1]]