app/views/home/_dishes.html.erb

            <% if current_user.present? %>
              <% pre_wishlisted = d.wishlists.find { |wishlist| wishlist.user_id == current_user.id} %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."dish_id" = $1  [["dish_id", 1]]

              <h2><%= link_to d.name, dish_path(d), :class => 'restaurant_link' %></h2>
                <% d.restaurants.each do |r|%>
---
SELECT "restaurants".* FROM "restaurants" INNER JOIN "dishes_restaurants" ON "restaurants"."id" = "dishes_restaurants"."restaurant_id" WHERE "dishes_restaurants"."dish_id" = $1  [["dish_id", 1]]