app/views/home/_search_dishes.html.erb

SELECT AVG("ratings"."rating") FROM "ratings" WHERE "ratings"."dish_id" = $1  [["dish_id", 2]]
---
          <div class="rating">
            <span class="restaurant_rating"><%= d.ratings.average(:rating).present? ? d.ratings.average(:rating).round(1) : 0 %>

SELECT "restaurants".* FROM "restaurants" INNER JOIN "dishes_restaurants" ON "restaurants"."id" = "dishes_restaurants"."restaurant_id" WHERE "dishes_restaurants"."dish_id" = $1  [["dish_id", 2]]
---
              <h2><%= d.name %></h2>
              <% d.restaurants.each do |r|%>

SELECT "locations".* FROM "locations" WHERE (city LIKE '%yanam%')
---
                <a style ="text-decoration-line: none;" target="_blank" href="http://maps.google.com/?q=<%=(r.locations.pluck(:street, :city, :state, :country).join(',')) %>">
                    <% r.locations.each do |l|%>