app/views/orders/index.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
---
<div class="container" style="margin-top: 100px;">
  <% count_orders = current_user.orders.count %>

SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 1]]
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          <div class="col-md-5">
            <% order.line_items.each do |d| %>
              <% d.dish.pictures.each do |p| %>