app/views/orders/show.html.erb

      <div class="row" style="border: 1px solid #d7d7d7; padding: 15px;">
				<% @order.line_items.each do |d| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 1]]

          <div>
            <% d.dish.pictures.each do |p| %>
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]