app/views/dishes/_all_reviews.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."dish_id" = $1  [["dish_id", 4]]
---
<% pre_rated = @dish.ratings.find { |rating| rating.user_id == current_user.id} %>