app/views/dishes/_overall_rating.html.erb

  <h4>Overall Rating &nbsp;
    <%= @dish.ratings.average(:rating).present? ? @dish.ratings.average(:rating).round(1) : 0 %>
      <i class="review-rating" data-score = " <%= @dish.ratings.average(:rating).present? ? @dish.ratings.average(:rating).round(1) : 0 %>"></i>
  </h4>
  <i >Based on <%= @dish.ratings.count(:rating) %> Reviews</i><br>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."dish_id" = $1  [["dish_id", 2]]
SELECT AVG("ratings"."rating") FROM "ratings" WHERE "ratings"."dish_id" = $1  [["dish_id", 1]]
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."dish_id" = $1 AND "ratings"."rating" = $2  [["dish_id", 2], ["rating", 3]]

  <div>
     <i class="review-rating" data-score = "5"></i> &nbsp;<span>(<%= @dish.ratings.where(rating: 5).count %>)</span>
---
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."dish_id" = $1 AND "ratings"."rating" = $2  [["dish_id", 1], ["rating", 5]]

  <div>
   <i class="review-rating" data-score = "4"></i> &nbsp;<span>(<%= @dish.ratings.where(rating: 4).count %>)</span>
---
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."dish_id" = $1 AND "ratings"."rating" = $2  [["dish_id", 1], ["rating", 4]]

  <div>
    <i class="review-rating" data-score = "3"></i> &nbsp;<span>(<%= @dish.ratings.where(rating: 3).count %>)</span>
---
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."dish_id" = $1 AND "ratings"."rating" = $2  [["dish_id", 1], ["rating", 3]]

  <div>
    <i class="review-rating" data-score = "2"></i> &nbsp;<span>(<%= @dish.ratings.where(rating: 2).count %>)</span>
---
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."dish_id" = $1 AND "ratings"."rating" = $2  [["dish_id", 1], ["rating", 2]]

  <div>
    <i class="review-rating" data-score = "1"></i> &nbsp;<span>(<%= @dish.ratings.where(rating: 1).count %>)</span>
---
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."dish_id" = $1 AND "ratings"."rating" = $2  [["dish_id", 1], ["rating", 1]]