app/controllers/addresses_controller.rb

  def index
    @addresses = Address.where(:user_id => current_user, :status => 'active')
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1 AND "addresses"."status" = $2  [["user_id", 1], ["status", "active"]]

  def create
    @cart = @current_cart
    @address = Address.new(address_params)
    y = params[:y]
    if @address.save!
---
INSERT INTO "addresses" ("full_name", "mobile", "pincode", "house_no", "street", "landmark", "city", "state", "user_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def edit
    @address = Address.find(params[:id])
---
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 52 LIMIT 1

  def deactivate
    a = Address.find(params[:id])
     y = params[:y]
    if (a.orders.count != 0)
      a.update_attributes(:status => 'deactive')
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."address_id" = $1  [["address_id", 1]]
UPDATE "addresses" SET "status" = $1, "updated_at" = $2 WHERE "addresses"."id" = $3  [["status", "deactive"], ["updated_at", "2020-04-20 08:47:38.628167"], ["id", 1]]