app/controllers/admin_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 5]]
---
  def dashboard
  	@orders = Order.all
  	@users = User.last(5)