app/controllers/checkout_controller.rb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1 ORDER BY "addresses"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def address
    @cart = @current_cart
    @address = Address.new
    @user_address = Address.where(:user_id => current_user, :status => 'active')

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def payment
    @cart = @current_cart
    @select_address = Address.find(params[:address_id])