app/controllers/home_controller.rb

SELECT "locations".* FROM "locations" WHERE (city LIKE '%yanam%')
SELECT  "dishes".* FROM "dishes" ORDER BY "dishes"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM `dishes`
---
  def index
    if  params[:location]
      @locations = Location.where("city LIKE ?", "%#{params[:location]}%")
      restaurants = []
      location_dishes = []
        @locations.each do |l|
          l.restaurants.each do |r|
            restaurants.push(r)
              r.dishes.each do |d|
                location_dishes.push(d)
              end
          end
        end
      @dishes = location_dishes.paginate(:page => params[:page], :city => params[:location], :per_page => 50)
    else
      @dishes = Dish.order(created_at: :desc).paginate(:page => params[:page], :per_page => 6)

SELECT  "dishes".* FROM "dishes" WHERE (name LIKE '%bir%') LIMIT $1 OFFSET $2  [["LIMIT", 6], ["OFFSET", 0]]
SELECT AVG("ratings"."rating") FROM "ratings" WHERE "ratings"."dish_id" = $1  [["dish_id", 2]]
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."category_id" = $1 AND (name LIKE '%%') LIMIT $2 OFFSET $3  [["category_id", 1], ["LIMIT", 50], ["OFFSET", 0]]
SELECT COUNT(*) FROM "dishes" INNER JOIN "dishes_restaurants" ON "dishes"."id" = "dishes_restaurants"."dish_id" WHERE "dishes_restaurants"."restaurant_id" = $1  [["restaurant_id", 6]]
---
  def search
    map_location
    if  params[:search]
    @dishes = Dish.paginate(page: params[:page],:per_page => 6).where("name LIKE ?", "%#{params[:search]}%")
    end

    if params[:price]
      @dishes = Dish.paginate(page: params[:page],:per_page => 50).by_price(params[:price]).where("name LIKE ?", "%#{params[:search]}%")
    end

    if params[:ratings]
      @dishes = Dish.paginate(page: params[:page],:per_page => 50).by_rating.where("name LIKE ?", "%#{params[:search]}%")
    end

    if params[:ratings_filter]
     @dishes = Dish.paginate(page: params[:page],:per_page => 50).sort_ratings(params[:ratings_filter]).where("name LIKE ?", "%#{params[:search]}%")
    end

    if params[:category]
      @dishes = Dish.paginate(page: params[:page],:per_page => 50).by_category(params[:category]).where("name LIKE ?", "%#{params[:search]}%")
    end

    if params[:restaurant_id]
      @restaurant = Restaurant.find(params[:restaurant_id])
      @dish1 = @restaurant.dishes.where("name LIKE ?", "%#{params[:search]}%")
      @dish2 = @restaurant.dishes.all.where("name NOT LIKE ?", "%#{params[:search]}%")
      @dishes = (@dish1  + @dish2).paginate(page: params[:page],:per_page => 50)

SELECT "dishes".* FROM "dishes" WHERE (name LIKE '%bir%')
---
  def map_location
    @dishes = Dish.all.where("name LIKE ?", "%#{params[:search]}%")
    locations = []
    restaurant = []
    @dishes.each do |d|