app/controllers/line_items_controller.rb

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "dishes" INNER JOIN "line_items" ON "dishes"."id" = "line_items"."dish_id" WHERE "line_items"."cart_id" = $1 AND "dishes"."id" = $2 LIMIT $3  [["cart_id", 7], ["id", 1], ["LIMIT", 1]]
INSERT INTO "line_items" ("dish_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dish_id", 1], ["cart_id", 7], ["created_at", "2020-04-18 03:02:19.129606"], ["updated_at", "2020-04-18 03:02:19.129606"]]
---
  def create
    chosen_product = Dish.find(params[:dish_id])
    current_cart = @current_cart

    # If cart already has this product then find the line_item otherwise create a new line_item
    if current_cart.dishes.include?(chosen_product)
      @line_item = current_cart.line_items.find_by(:dish_id => chosen_product)
      @line_item.quantity += 1
    else
      @line_item = LineItem.new
      @line_item.cart = current_cart
      @line_item.dish = chosen_product
    end
    # Save and redirect to cart show path
    @line_item.save