app/controllers/orders_controller.rb

  def index
    @orders = Order.where(:user_id => current_user)
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]

  def create
    @cart = @current_cart
    @order = Order.new

    # Stripe Api customer create
    customer = Stripe::Customer.create({
      email: params[:stripeEmail],
      source: params[:stripeToken],
      name: current_user.name
    })

    # Stripe Api payment create
    charge = Stripe::Charge.create({
      customer: customer.id,
      amount: (@current_cart.sub_total * 100).floor,
      description: "Dishes",
      currency: 'INR',
    })

    #If Payment success create Order
    if charge["paid"] == true
      @order = Order.new(
        user_id: current_user.id,
        amount: @current_cart.sub_total,
        address_id:current_user.addresses.last.id,
        payment_id: charge.id,
        transaction_id: charge.balance_transaction,
        stripe_customer_id: customer.id,
        payment_type: 'Stripe',
        payment: 'Success',
        order_status: 'Processed'
      )

        @current_cart.line_items.each do |item|
            @order.line_items << item
            item.cart_id = nil
        end
        @order.save
        Cart.destroy(session[:cart_id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1 ORDER BY "addresses"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 7]]
INSERT INTO `orders` (`user_id`, `amount`, `created_at`, `updated_at`, `payment_id`, `transaction_id`, `stripe_customer_id`, `payment`, `payment_type`, `address_id`, `order_status`) VALUES (51, 55, '2020-03-31 11:09:32', '2020-03-31 11:09:32', 'ch_1GShyJDL9zYXtHaJC1URtvsJ', 'txn_1GShyJDL9zYXtHaJYZ6Qd010', 'cus_H0jRpCP0lVXyj2', 'Success', 'Stripe', 59, 'Processed')
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 7]]

    def success
      @payment = Order.last
---
SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT $1  [["LIMIT", 1]]