app/controllers/ratings_controller.rb

  def create
    @dish = Dish.find(rating_params[:dish_id])
    if already_rated?
      flash[:notice] = "You can't review more than once"
    else
      @rating = Rating.create(rating_params)
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "ratings" ("rating", "dish_id", "created_at", "updated_at", "comments", "user_id", "user_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def already_rated?
    Rating.where(user_id: current_user.id, dish_id:
    rating_params[:dish_id]).exists?
---
SELECT  1 AS one FROM "ratings" WHERE "ratings"."user_id" = $1 AND "ratings"."dish_id" = $2 LIMIT $3  [["user_id", 1], ["dish_id", 4], ["LIMIT", 1]]

  def edit
    @rating = Rating.find(params[:id])
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    @dish = Dish.find(params[:dish_id])
    @rating = Rating.find(params[:id])

    respond_to do |format|
      if @rating.update_attributes(rating_params)
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "ratings" SET "comments" = $1, "updated_at" = $2 WHERE "ratings"."id" = $3  [["comments", "xxxxxxxxxxxxxxxgggg"], ["updated_at", "2020-04-23 12:11:59.570085"], ["id", 3]]

  def destroy
    @rating = Rating.find(params[:id])
    @dish = Dish.find(params[:dish_id])
    @rating.destroy
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "ratings" WHERE "ratings"."id" = $1  [["id", 1]]