app/controllers/wishlists_controller.rb

SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."user_id" = $1  [["user_id", 2]]
---
  def index
    @wishlists = Wishlist.where(:user_id => current_user)

INSERT INTO "wishlists" ("user_id", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["dish_id", 2], ["created_at", "2020-04-23 08:52:48.130800"], ["updated_at", "2020-04-23 08:52:48.130800"]]
---
  def create
    if already_wishlisted?
      flash[:notice] = "You can't wishlist more than once"
    else
      @dish.wishlists.create(user_id: current_user.id)

SELECT  1 AS one FROM "wishlists" WHERE "wishlists"."user_id" = $1 AND "wishlists"."dish_id" = $2 LIMIT $3  [["user_id", 2], ["dish_id", 2], ["LIMIT", 1]]
---
  def already_wishlisted?
    Wishlist.where(user_id: current_user.id, dish_id:
    params[:dish_id]).exists?

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  1 AS one FROM "dishes" INNER JOIN "line_items" ON "dishes"."id" = "line_items"."dish_id" WHERE "line_items"."cart_id" = $1 AND "dishes"."id" = $2 LIMIT $3  [["cart_id", 23], ["id", 4], ["LIMIT", 1]]
SELECT  "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1 AND "line_items"."dish_id" = $2 LIMIT $3  [["cart_id", 23], ["dish_id", 4], ["LIMIT", 1]]
INSERT INTO "line_items" ("dish_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dish_id", 4], ["cart_id", 23], ["created_at", "2020-04-23 10:21:05.473222"], ["updated_at", "2020-04-23 10:21:05.473222"]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2020-04-23 10:31:45.723275"], ["id", 4]]
DELETE FROM "wishlists" WHERE "wishlists"."id" = $1  [["id", 2]]
---
  def add_to_cart
    chosen_product = Dish.find(params[:dish_id])
    current_cart = @current_cart

    # If cart already has this dish then find the line_item otherwise create a new line_item for this dish
    if current_cart.dishes.include?(chosen_product)
      @line_item = current_cart.line_items.find_by(:dish_id => chosen_product)
      @line_item.quantity += 1
    else
      @line_item = LineItem.new
      @line_item.cart = current_cart
      @line_item.dish = chosen_product
    end
    # Save and redirect to cart show path
    @line_item.save
    @wishlist.destroy

DELETE FROM "wishlists" WHERE "wishlists"."id" = $1  [["id", 6]]
---
  def destroy
    if !(already_wishlisted?)
      flash[:notice] = "Cannot unwishlist"
    else
      @wishlist.destroy

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."dish_id" = $1 AND "wishlists"."id" = $2 LIMIT $3  [["dish_id", 4], ["id", 2], ["LIMIT", 1]]
---
  def find_wishlist
    @dish = Dish.find(params[:dish_id])
    @wishlist = @dish.wishlists.find(params[:id])

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def find_dish
    @dish = Dish.find(params[:dish_id])