app/models/cart.rb

  def sub_total
    sum = 0
    self.line_items.each do |line_item|
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 7]]