app/models/dish.rb

    def self.get_previous_dish(current_dish)
      Dish.where("dishes.id < ? ", current_dish.id).order('created_at asc').last
---
SELECT  "dishes".* FROM "dishes" WHERE (dishes.id < 3 ) ORDER BY created_at DESC LIMIT $1  [["LIMIT", 1]]

    def self.get_next_dish(current_dish)
      Dish.where("dishes.id > ? ", current_dish.id).order('created_at asc').first
---
SELECT  "dishes".* FROM "dishes" WHERE (dishes.id > 2 ) ORDER BY created_at asc LIMIT $1  [["LIMIT", 1]]