app/models/user.rb

SELECT  `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1
---
  def self.from_omniauth(auth)
    where(auth.slice(:provider, :uid)).first_or_create do |user|