app/views/admin/users/index.html.erb

          <td><%= r.created_at.strftime("%B, %d, %Y") %></td>
          <td align="center"><%= r.orders.count %></td>
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 53
SELECT COUNT(*) FROM `orders` WHERE `orders`.`user_id` = 53

            <% @total_spent = 0 %>
            <% r.orders.each do |o| %>
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 53