app/views/wishlists/index.html.erb

SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."user_id" = $1  [["user_id", 2]]
SELECT COUNT(*) FROM "wishlists" WHERE "wishlists"."user_id" = $1  [["user_id", 1]]
---
  <% if current_user.present? %>
    <% count_list = current_user.wishlists.count %>

SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."user_id" = $1  [["user_id", 2]]
SELECT COUNT(*) FROM "wishlists" WHERE "wishlists"."user_id" = $1  [["user_id", 2]]
---
              <div class="hm_featured_books_title">
                <div class="h5">My Wishlist (<%= current_user.wishlists.count %>)</div>

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
                    <%= link_to dish_path(wishlist.dish) do %>
                      <% wishlist.dish.pictures.each do |p| %>