app/views/admin/dishes/index.html.erb

          <td>&#8377; <%= d.price %></td>
          <td><%= d.ratings.average(:rating) %></td>
          <td><%= d.ratings.count(:rating) %></td>
---
SELECT AVG("ratings"."rating") FROM "ratings" WHERE "ratings"."dish_id" = $1  [["dish_id", 1]]
SELECT COUNT("ratings"."rating") FROM "ratings" WHERE "ratings"."dish_id" = $1  [["dish_id", 1]]